## 2021: Week 34 - Excelling with lookups

As we come to the end of our excel challenges month, it seems only right to think about vlookups and index matches. In Excel, these are great functions for bringing together data from different worksheets without having to manually copy and paste. 

Our scenario this week is looking at Employee Sales at Allchains for each month of the year so far and we want to compare this to their Monthly Targets, stored on another sheet.

### Input
We have 2 inputs this week:
- Employee Sales
![img](https://lh3.googleusercontent.com/-YLkCUIZ-ewo/YSX2-_sNHkI/AAAAAAAAA5Y/LLKXwtA3zskTzUUNZORq8GSCo0TeI_pywCLcBGAsYHQ/w640-h150/image.png)

- Employee Targets
![img](https://lh3.googleusercontent.com/-dDch-RN5_KM/YSX3KZuKw5I/AAAAAAAAA5c/Uw76vgyf1gY4bQusHo0LCGSsN6FjsmBnQCLcBGAsYHQ/image.png)

### Requirement
- Input data
- Calculate the Average Monthly Sales for each employee
- In the Targets sheet the Store Name needs cleaning up
- Filter the data so that only employees who are below 90% of their target on average remain
- For these employees, we also want to know the % of months that they met/exceeded their target
- Output the data

### Output
![img](https://lh3.googleusercontent.com/-eztfs2p3UiU/YSX476gCsyI/AAAAAAAAA5o/KFMDSQML980A4JNi1KtJWL_XJi_YmPPjACLcBGAsYHQ/image.png)

- 5 fields
    - Store
    - Employee
    - Avg monthly Sales
    - % of months target met
    - Monthly Target
- 4 rows (5 including headers)

In [649]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Input data

In [650]:
data = pd.read_excel("./data/2021 Week 34 Input.xlsx", sheet_name=[0, 1])

In [651]:
employee_sales = data[0].copy()
employee_targets = data[1].copy()

### Calculate the Average Monthly Sales for each employee

In [653]:
employee_sales.head()

,Store,Employee,2021-01-01 00:00:00,2021-02-01 00:00:00,2021-03-01 00:00:00,2021-04-01 00:00:00,2021-05-01 00:00:00,2021-06-01 00:00:00,2021-07-01 00:00:00
0,Stratford,Julie,3302,3450,2642,4647,7493,5088,8414
1,Stratford,Pete,4052,2987,5328,8429,3616,5397,8588
2,Stratford,Jose,5226,1631,7497,2134,5814,895,5312
3,Stratford,Andre,9369,9255,1738,3543,8126,5953,3370
4,Stratford,Edward,7854,3059,9304,2304,5331,5928,8608

In [654]:
employee_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Store                35 non-null     object
 1   Employee             35 non-null     object
 2   2021-01-01 00:00:00  35 non-null     int64
 3   2021-02-01 00:00:00  35 non-null     int64
 4   2021-03-01 00:00:00  35 non-null     int64
 5   2021-04-01 00:00:00  35 non-null     int64
 6   2021-05-01 00:00:00  35 non-null     int64
 7   2021-06-01 00:00:00  35 non-null     int64
 8   2021-07-01 00:00:00  35 non-null     int64
dtypes: int64(7), object(2)
memory usage: 2.6+ KB

In [655]:
employee_targets.head()

       Store Employee  Monthly Target
0   Stratfod    Julie            5000
1  Stratford     Pete            5000
2  Stratford     Jose            5000
3  Stratfodd    Andre            6000
4  Stratford   Edward            6000

In [656]:
employee_targets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Store           35 non-null     object
 1   Employee        35 non-null     object
 2   Monthly Target  35 non-null     int64
dtypes: int64(1), object(2)
memory usage: 968.0+ bytes

In [657]:
employee_sales.columns

Index([            'Store',          'Employee', 2021-01-01 00:00:00,
       2021-02-01 00:00:00, 2021-03-01 00:00:00, 2021-04-01 00:00:00,
       2021-05-01 00:00:00, 2021-06-01 00:00:00, 2021-07-01 00:00:00],
      dtype='object')

In [658]:
columns_names = []
for i in employee_sales.columns:
    tmp = str(i)
    tmp = tmp.split()[0]
    tmp = tmp.strip()
    columns_names.append(tmp)

In [659]:
employee_sales.columns = columns_names
employee_sales

,Store,Employee,2021-01-01,2021-02-01,2021-03-01,2021-04-01,2021-05-01,2021-06-01,2021-07-01
0,Stratford,Julie,3302,3450,2642,4647,7493,5088,8414
1,Stratford,Pete,4052,2987,5328,8429,3616,5397,8588
2,Stratford,Jose,5226,1631,7497,2134,5814,895,5312
3,Stratford,Andre,9369,9255,1738,3543,8126,5953,3370
4,Stratford,Edward,7854,3059,9304,2304,5331,5928,8608
5,Stratford,Isla,583,5051,8761,8858,7924,4334,9074
6,Stratford,Ingrid,6020,2684,1261,6780,4539,9535,1594
7,Stratford,Jessie,7424,5931,8493,396,2689,1003,8761
8,Stratford,Ezra,7355,5338,1740,6676,6288,1373,5965
9,Stratford,Patrick,9790,5791,4978,8294,3155,5520,6961
10,Wimbledon,Edward,1570,3455,1976,8431,3930,3901,7472
11,Wimbledon,Francis,5773,2544,3232,2148,5068,8365,4000
12,Wimbledon,Oscar,3083,8507,159,466,6334,395,7639
13,Wimbledon,Olivia,6417,4767,2534,2653,9041,3605,1955
14,Wimbledon,Penelope,2910,9909,2483,4648,8549,89,6921
15,Wimbledon,Pete,5731,7932,8440,4981,3698,523,9101
16,Wimbledon,Quentin,3030,658,350,6304,4766,3492,5110
17,Wimbledon,Victoria,9168,6314,2935,2565,7399,482,8664
18,Wimbledon,Lily,6113,3893,1400,8848,580,9610,7033
19,Wimbledon,Angus,1554,8694,8137,7035,3828,6468,5740
20,Bristol,Cecilia,5266,9859,7948,4589,1049,2388,1319
21,Bristol,Rhys,9298,1596,488,5146,3293,4526,8893
22,Bristol,Olivia,6759,9924,8250,9131,9415,2914,740
23,Bristol,Jessie,7905,1250,3429,8534,2193,8105,5354
24,Bristol,Laura,8497,6900,1834,437,6919,6240,689
25,Bristol,Cat,2879,9257,9129,9108,9015,2439,4895
26,York,William,4246,4808,4472,5569,8047,5607,4559
27,York,Sophie,326,6558,2039,8859,8887,7397,3670
28,York,Molly,7633,5434,8711,4306,4401,5283,4592
29,York,Zack,6056,2088,4554,8833,1145,1483,7087
30,York,Jessie,92,9029,350,8545,9512,9417,7786
31,York,Xavier,7690,3835,6728,7383,2388,526,3619
32,York,Sam,8413,3121,2052,1300,3200,8923,1129
33,York,John,8535,7372,5601,9876,5266,6157,3452
34,York,Edward,5611,9200,6685,5070,1415,5762,6504

In [660]:
employee_sales["Employee"].nunique()

29

In [661]:
grouped = employee_sales.groupby(["Store","Employee"])
avg_monthly_sales = grouped.mean().mean(axis=1)
avg_monthly_sales = avg_monthly_sales.reset_index().rename(columns={0: "Avg monthly Sales"})
avg_monthly_sales

# avg_monthly_sales = employee_sales.groupby(["Employee"]).sum().sum(axis=1) / 7
# avg_monthly_sales = avg_monthly_sales.reset_index().rename(columns={0: "Avg monthly Sales"})
# avg_monthly_sales

# avg_monthly_sales = avg_monthly_sales.reset_index()
# avg_monthly_sales["Avg monthly Sales"] = avg_monthly_sales.mean(axis=1)
# avg_monthly_sales = avg_monthly_sales[["Employee", "Avg monthly Sales"]]
# avg_monthly_sales

        Store  Employee  Avg monthly Sales
0     Bristol       Cat        6674.571429
1     Bristol   Cecilia        4631.142857
2     Bristol    Jessie        5252.857143
3     Bristol     Laura        4502.285714
4     Bristol    Olivia        6733.285714
5     Bristol      Rhys        4748.571429
6   Stratford     Andre        5907.714286
7   Stratford    Edward        6055.428571
8   Stratford      Ezra        4962.142857
9   Stratford    Ingrid        4630.428571
10  Stratford      Isla        6369.285714
11  Stratford    Jessie        4956.714286
12  Stratford      Jose        4072.714286
13  Stratford     Julie        5005.142857
14  Stratford   Patrick        6355.571429
15  Stratford      Pete        5485.285714
16  Wimbledon     Angus        5922.285714
17  Wimbledon    Edward        4390.714286
18  Wimbledon   Francis        4447.142857
19  Wimbledon      Lily        5353.857143
20  Wimbledon    Olivia        4424.571429
21  Wimbledon     Oscar        3797.571429
22  Wimbledon  Penelope        5072.714286
23  Wimbledon      Pete        5772.285714
24  Wimbledon   Quentin        3387.142857
25  Wimbledon  Victoria        5361.000000
26       York    Edward        5749.571429
27       York    Jessie        6390.142857
28       York      John        6608.428571
29       York     Molly        5765.714286
30       York       Sam        4019.714286
31       York    Sophie        5390.857143
32       York   William        5329.714286
33       York    Xavier        4595.571429
34       York      Zack        4463.714286

### In the Targets sheet the Store Name needs cleaning up

In [663]:
employee_targets

         Store  Employee  Monthly Target
0     Stratfod     Julie            5000
1    Stratford      Pete            5000
2    Stratford      Jose            5000
3    Stratfodd     Andre            6000
4    Stratford    Edward            6000
5    Stratford      Isla            7000
6     Statford    Ingrid            5000
7    Stratford    Jessie            5000
8     Straford      Ezra            5000
9    Stratford   Patrick            7000
10   Wimbledan    Edward            5000
11   Wimbledon   Francis            5000
12   Wimbledon     Oscar            4000
13   Vimbledon    Olivia            4000
14   Wimbledon  Penelope            5000
15   Wimbledon      Pete            6000
16   Wimbledon   Quentin            4000
17   Wimbledon  Victoria            5000
18  Wimbledone      Lily            5000
19   Wimbledon     Angus            6000
20    Bristoll   Cecilia            5000
21     Bristol      Rhys            5000
22     Bristal    Olivia            7000
23     Bristol    Jessie            5000
24     Bristol     Laura            4000
25    Bristole       Cat            7000
26        York   William            5000
27        York    Sophie            5000
28         Yor     Molly            6000
29        York      Zack            4000
30        York    Jessie            6000
31        York    Xavier            5000
32       Yorkk       Sam            4000
33        York      John            7000
34        Yark    Edward            5000

In [664]:
import re
store_names = employee_sales["Store"].unique().tolist()
store = re.compile(store_names[0][:3])
match = store.search(employee_targets["Store"][0])

In [665]:
employee_targets["Store"].map(lambda x: re.match(r'k$', x))
re.search(r'd$', employee_targets["Store"][0])

In [666]:
employee_targets["Store"].map(lambda x: re.search(r'd$', x)).head()

0    <re.Match object; span=(7, 8), match='d'>
1    <re.Match object; span=(8, 9), match='d'>
2    <re.Match object; span=(8, 9), match='d'>
3    <re.Match object; span=(8, 9), match='d'>
4    <re.Match object; span=(8, 9), match='d'>
Name: Store, dtype: object

In [667]:
store_names = employee_sales["Store"].unique().tolist()

def replace_store_names(x):
    if re.search(r"^St", x):
        return store_names[0]
    
    elif re.search(r"imb", x):
        return store_names[1]
    
    elif re.search(r"^Bri", x):
        return store_names[2]
    
    elif re.search(r"^Y", x):
        return store_names[3]

employee_targets["Store"] = employee_targets["Store"].map(lambda x: replace_store_names(x))
employee_targets

        Store  Employee  Monthly Target
0   Stratford     Julie            5000
1   Stratford      Pete            5000
2   Stratford      Jose            5000
3   Stratford     Andre            6000
4   Stratford    Edward            6000
5   Stratford      Isla            7000
6   Stratford    Ingrid            5000
7   Stratford    Jessie            5000
8   Stratford      Ezra            5000
9   Stratford   Patrick            7000
10  Wimbledon    Edward            5000
11  Wimbledon   Francis            5000
12  Wimbledon     Oscar            4000
13  Wimbledon    Olivia            4000
14  Wimbledon  Penelope            5000
15  Wimbledon      Pete            6000
16  Wimbledon   Quentin            4000
17  Wimbledon  Victoria            5000
18  Wimbledon      Lily            5000
19  Wimbledon     Angus            6000
20    Bristol   Cecilia            5000
21    Bristol      Rhys            5000
22    Bristol    Olivia            7000
23    Bristol    Jessie            5000
24    Bristol     Laura            4000
25    Bristol       Cat            7000
26       York   William            5000
27       York    Sophie            5000
28       York     Molly            6000
29       York      Zack            4000
30       York    Jessie            6000
31       York    Xavier            5000
32       York       Sam            4000
33       York      John            7000
34       York    Edward            5000

### Filter the data so that only employees who are below 90% of their target on average remain

In [669]:
avg_monthly_sales = avg_monthly_sales.merge(employee_targets, how="left", on=["Store", "Employee"])
avg_monthly_sales["Avg monthly Sales"] = avg_monthly_sales["Avg monthly Sales"].round(0).astype(int)

In [670]:
below_90_pct = avg_monthly_sales["Avg monthly Sales"] < avg_monthly_sales["Monthly Target"] * 0.9
results = avg_monthly_sales.loc[below_90_pct, :]
results

        Store Employee  Avg monthly Sales  Monthly Target
12  Stratford     Jose               4073            5000
17  Wimbledon   Edward               4391            5000
18  Wimbledon  Francis               4447            5000
24  Wimbledon  Quentin               3387            4000

### For these employees, we also want to know the % of months that they met/exceeded their target

In [672]:
results_info = employee_sales.merge(results, how="inner", on=["Store", "Employee"])
results_info = results_info.drop("Avg monthly Sales", axis=1)
results_info

,Store,Employee,2021-01-01,2021-02-01,2021-03-01,2021-04-01,2021-05-01,2021-06-01,2021-07-01,Monthly Target
0,Stratford,Jose,5226,1631,7497,2134,5814,895,5312,5000
1,Wimbledon,Edward,1570,3455,1976,8431,3930,3901,7472,5000
2,Wimbledon,Francis,5773,2544,3232,2148,5068,8365,4000,5000
3,Wimbledon,Quentin,3030,658,350,6304,4766,3492,5110,4000

In [674]:
def count_over_monthly_target(row):
    bool_list = row[["2021-01-01", "2021-02-01", "2021-03-01", "2021-04-01", "2021-05-01",
              "2021-06-01", "2021-07-01"]] >= row["Monthly Target"]
    return sum(bool_list) / 7 * 100

In [675]:
target_met = results_info.apply(lambda x: count_over_monthly_target(x), axis=1).round(0).astype(int)
results.loc[:, "% of months target met"] = target_met.values
results = results.loc[:, ["Store", "Employee", "Avg monthly Sales", "% of months target met", "Monthly Target"]]
results

C:\Users\HYUNJUN\anaconda3\envs\deep-learning-gpu\lib\site-packages\pandas\core\indexing.py:1667: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = value

,Store,Employee,Avg monthly Sales,% of months target met,Monthly Target
12,Stratford,Jose,4073,57,5000
17,Wimbledon,Edward,4391,29,5000
18,Wimbledon,Francis,4447,43,5000
24,Wimbledon,Quentin,3387,43,4000

In [676]:
results = results.reset_index(drop=True)
results.to_csv("./output/Week34_output.csv")